Revit 2026 API

# IFCFileModelOptionsSchemaName Property

---

The name of the schema.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string SchemaName { get; set; }
```
```vb
Public Property SchemaName As String
	Get
	Set
```
```cpp
public:
property String^ SchemaName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member SchemaName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

IFCFileModelOptions Class

Autodesk.Revit.DB.IFC Namespace